In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\kwkan\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: numpy>=1.16.5 in c:\users\kwkan\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\kwkan\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\kwkan\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\kwkan\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [2]:
import pandas as pd

In [23]:
import numpy as np
dataset=np.array([['kor',70],['math',80]])
df = pd.DataFrame(dataset, columns=['class','score'])

In [24]:
dataset

array([['kor', '70'],
       ['math', '80']], dtype='<U11')

In [25]:
df

  class score
0   kor    70
1  math    80

In [4]:
df.to_csv('result.csv', header=True, index=True, encoding='utf-8')

In [12]:
#읽어오기, index 없을 때
readdf = pd.read_csv('result.csv', index_col=0)

In [15]:
#현재 디렉토리 위치
import os
os.getcwd()

'C:\\Users\\kwkan\\pythonStudy\\파이썬 한권으로 끝내기'

In [13]:
readdf

  class  score
0   kor     70
1  math     80

In [15]:
!pip install scikit-learn
from sklearn.datasets import load_iris
iris=load_iris()

Requirement already satisfied: scikit-learn in c:\users\kwkan\anaconda3\lib\site-packages (1.1.1)
Requirement already satisfied: scipy>=1.3.2 in c:\users\kwkan\anaconda3\lib\site-packages (from scikit-learn) (1.6.2)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\kwkan\anaconda3\lib\site-packages (from scikit-learn) (2.1.0)
Requirement already satisfied: joblib>=1.0.0 in c:\users\kwkan\anaconda3\lib\site-packages (from scikit-learn) (1.0.1)
Requirement already satisfied: numpy>=1.17.3 in c:\users\kwkan\anaconda3\lib\site-packages (from scikit-learn) (1.20.1)

In [16]:
iris

{'data': array([[5.1, 3.5, 1.4, 0.2],
        [4.9, 3. , 1.4, 0.2],
        [4.7, 3.2, 1.3, 0.2],
        [4.6, 3.1, 1.5, 0.2],
        [5. , 3.6, 1.4, 0.2],
        [5.4, 3.9, 1.7, 0.4],
        [4.6, 3.4, 1.4, 0.3],
        [5. , 3.4, 1.5, 0.2],
        [4.4, 2.9, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.1],
        [5.4, 3.7, 1.5, 0.2],
        [4.8, 3.4, 1.6, 0.2],
        [4.8, 3. , 1.4, 0.1],
        [4.3, 3. , 1.1, 0.1],
        [5.8, 4. , 1.2, 0.2],
        [5.7, 4.4, 1.5, 0.4],
        [5.4, 3.9, 1.3, 0.4],
        [5.1, 3.5, 1.4, 0.3],
        [5.7, 3.8, 1.7, 0.3],
        [5.1, 3.8, 1.5, 0.3],
        [5.4, 3.4, 1.7, 0.2],
        [5.1, 3.7, 1.5, 0.4],
        [4.6, 3.6, 1. , 0.2],
        [5.1, 3.3, 1.7, 0.5],
        [4.8, 3.4, 1.9, 0.2],
        [5. , 3. , 1.6, 0.2],
        [5. , 3.4, 1.6, 0.4],
        [5.2, 3.5, 1.5, 0.2],
        [5.2, 3.4, 1.4, 0.2],
        [4.7, 3.2, 1.6, 0.2],
        [4.8, 3.1, 1.6, 0.2],
        [5.4, 3.4, 1.5, 0.4],
        [5.2, 4.1, 1.5, 0.1],
        [5.5, 4.2, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.2],
        [5. , 3.2, 1.2, 0.2],
        [5.5, 3.5, 1.3, 0.2],
        [4.9, 3.6, 1.4, 0.1],
        [4.4, 3. , 1.3, 0.2],
        [5.1, 3.4, 1.5, 0.2],
        [5. , 3.5, 1.3, 0.3],
        [4.5, 2.3, 1.3, 0.3],
        [4.4, 3.2, 1.3, 0.2],
        [5. , 3.5, 1.6, 0.6],
        [5.1, 3.8, 1.9, 0.4],
        [4.8, 3. , 1.4, 0.3],
        [5.1, 3.8, 1.6, 0.2],
        [4.6, 3.2, 1.4, 0.2],
        [5.3, 3.7, 1.5, 0.2],
        [5. , 3.3, 1.4, 0.2],
        [7. , 3.2, 4.7, 1.4],
        [6.4, 3.2, 4.5, 1.5],
        [6.9, 3.1, 4.9, 1.5],
        [5.5, 2.3, 4. , 1.3],
        [6.5, 2.8, 4.6, 1.5],
        [5.7, 2.8, 4.5, 1.3],
        [6.3, 3.3, 4.7, 1.6],
        [4.9, 2.4, 3.3, 1. ],
        [6.6, 2.9, 4.6, 1.3],
        [5.2, 2.7, 3.9, 1.4],
        [5. , 2. , 3.5, 1. ],
        [5.9, 3. , 4.2, 1.5],
        [6. , 2.2, 4. , 1. ],
        [6.1, 2.9, 4.7, 1.4],
        [5.6, 2.9, 3.6, 1.3],
        [6.7, 3.1, 4.4, 1.4],
        [5.6, 3. , 4.5, 1.5],
        [5.8, 2.7, 4.1, 1. ],
        [6.2, 2.2, 4.5, 1.5],
        [5.6, 2.5, 3.9, 1.1],
        [5.9, 3.2, 4.8, 1.8],
        [6.1, 2.8, 4. , 1.3],
        [6.3, 2.5, 4.9, 1.5],
        [6.1, 2.8, 4.7, 1.2],
        [6.4, 2.9, 4.3, 1.3],
        [6.6, 3. , 4.4, 1.4],
        [6.8, 2.8, 4.8, 1.4],
        [6.7, 3. , 5. , 1.7],
        [6. , 2.9, 4.5, 1.5],
        [5.7, 2.6, 3.5, 1. ],
        [5.5, 2.4, 3.8, 1.1],
        [5.5, 2.4, 3.7, 1. ],
        [5.8, 2.7, 3.9, 1.2],
        [6. , 2.7, 5.1, 1.6],
        [5.4, 3. , 4.5, 1.5],
        [6. , 3.4, 4.5, 1.6],
        [6.7, 3.1, 4.7, 1.5],
        [6.3, 2.3, 4.4, 1.3],
        [5.6, 3. , 4.1, 1.3],
        [5.5, 2.5, 4. , 1.3],
        [5.5, 2.6, 4.4, 1.2],
        [6.1, 3. , 4.6, 1.4],
        [5.8, 2.6, 4. , 1.2],
        [5. , 2.3, 3.3, 1. ],
        [5.6, 2.7, 4.2, 1.3],
        [5.7, 3. , 4.2, 1.2],
        [5.7, 2.9, 4.2, 1.3],
        [6.2, 2.9, 4.3, 1.3],
        [5.1, 2.5, 3. , 1.1],
        [5.7, 2.8, 4.1, 1.3],
        [6.3, 3.3, 6. , 2.5],
        [5.8, 2.7, 5.1, 1.9],
        [7.1, 3. , 5.9, 2.1],
        [6.3, 2.9, 5.6, 1.8],
        [6.5, 3. , 5.8, 2.2],
        [7.6, 3. , 6.6, 2.1],
        [4.9, 2.5, 4.5, 1.7],
        [7.3, 2.9, 6.3, 1.8],
        [6.7, 2.5, 5.8, 1.8],
        [7.2, 3.6, 6.1, 2.5],
        [6.5, 3.2, 5.1, 2. ],
        [6.4, 2.7, 5.3, 1.9],
        [6.8, 3. , 5.5, 2.1],
        [5.7, 2.5, 5. , 2. ],
        [5.8, 2.8, 5.1, 2.4],
        [6.4, 3.2, 5.3, 2.3],
        [6.5, 3. , 5.5, 1.8],
        [7.7, 3.8, 6.7, 2.2],
        [7.7, 2.6, 6.9, 2.3],
        [6. , 2.2, 5. , 1.5],
        [6.9, 3.2, 5.7, 2.3],
        [5.6, 2.8, 4.9, 2. ],
        [7.7, 2.8, 6.7, 2. ],
        [6.3, 2.7, 4.9, 1.8],
        [6.7, 3.3, 5.7, 2.1],
        [7.2, 3.2, 6. , 1.8],
        [6.2, 2.8, 4.8, 1.8],
        [6.1, 3. , 4.9, 1.8],
        [6.4, 2.8, 5.6, 2.1],
        [7.2, 3. , 5.8, 1.6],
        [7.4, 2.8, 6.1, 1.9],
        [7.9, 3.8, 6.4, 2. ],
        [6.4, 2.8, 5.6, 2.2],
        [6.3, 2.8, 5.1, 1.5],
        [6.1, 2.6, 5.6, 1.4],
        [7.7, 3. , 6.1, 2.3],
        [6.3, 3.4, 5.6, 2.4],
        [6.4, 3.1, 5.5, 1.8],
        [6. , 3. , 4.8, 1.8],
        [6.9, 3.1, 5.4, 2.1],
        [6.7, 3.1, 5.6, 2.4],
        [6.9, 3.1, 5.1, 2.3],
        [5.8, 2.7, 5.1, 1.9],
        [6.8, 3.2, 5.9, 2.3],
        [6.7, 3.3, 5.7, 2.5],
        [6.7, 3. , 5.2, 2.3],
        [6.3, 2.5, 5. , 1.9],
        [6.5, 3. , 5.2, 2. ],
        [6.2, 3.4, 5.4, 2.3],
        [5.9, 3. , 5.1, 1.8]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]),
 'frame': None,
 'target_names': array(['setosa', 'versicolor', 'virginica'], dtype='<U10'),
 'DESCR': '.. _iris_dataset:\n\nIris plants dataset\n--------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 150 (50 in each of three classes)\n    :Number of Attributes: 4 numeric, predictive attributes and the class\n    :Attribute Information:\n        - sepal length in cm\n        - sepal width in cm\n        - petal length in cm\n        - petal width in cm\n        - class:\n                - Iris-Setosa\n                - Iris-Versicolour\n                - Iris-Virginica\n                \n    :Summary Statistics:\n\n    ============== ==== ==== ======= ===== ====================\n                    Min  Max   Mean    SD   Class Correlation\n    ============== ==== ==== ======= ===== ====================\n    sepal length:   4.3  7.9   5.84   0.83    0.7826\n    sepal width:    2.0  4.4   3.05   0.43   -0.4194\n    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)\n    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)\n    ============== ==== ==== ======= ===== ====================\n\n    :Missing Attribute Values: None\n    :Class Distribution: 33.3% for each of 3 classes.\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThe famous Iris database, first used by Sir R.A. Fisher. The dataset is taken\nfrom Fisher\'s paper. Note that it\'s the same as in R, but not as in the UCI\nMachine Learning Repository, which has two wrong data points.\n\nThis is perhaps the best known database to be found in the\npattern recognition literature.  Fisher\'s paper is a classic in the field and\nis referenced frequently to this day.  (See Duda & Hart, for example.)  The\ndata set contains 3 classes of 50 instances each, where each class refers to a\ntype of iris plant.  One class is linearly separable from the other 2; the\nlatter are NOT linearly separable from each other.\n\n.. topic:: References\n\n   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"\n     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to\n     Mathematical Statistics" (John Wiley, NY, 1950).\n   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.\n     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.\n   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System\n     Structure and Classification Rule for Recognition in Partially Exposed\n     Environments".  IEEE Transactions on Pattern Analysis and Machine\n     Intelligence, Vol. PAMI-2, No. 1, 67-71.\n   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions\n     on Information Theory, May 1972, 431-433.\n   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II\n     conceptual clustering system finds 3 classes in the data.\n   - Many, many more ...',
 'feature_names': ['sepal length (cm)',
  'sepal width (cm)',
  'petal length (cm)',
  'petal width (cm)'],
 'filename': 'iris.csv',
 'data_module': 'sklearn.datasets.data'}

In [17]:
iris=pd.DataFrame(iris.data, columns=iris.feature_names)

In [18]:
iris

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [19]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sepal length (cm)  150 non-null    float64
 1   sepal width (cm)   150 non-null    float64
 2   petal length (cm)  150 non-null    float64
 3   petal width (cm)   150 non-null    float64
dtypes: float64(4)
memory usage: 4.8 KB

In [20]:
iris.describe()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

In [26]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [27]:
list(df.index)

[0, 1]

In [28]:
df.index=['A','B']

In [29]:
list(df.index)

['A', 'B']

In [30]:
df.set_index('class', drop=True, append=False, inplace=True)

In [31]:
df

      score
class
kor      70
math     80

# 인덱스 재설정하기

In [33]:

df.reset_index(drop=False, inplace=True)

In [34]:
df

  class score
0   kor    70
1  math    80

In [35]:
iris.columns

Index(['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)',
       'petal width (cm)'],
      dtype='object')

In [37]:
iris.columns=['sepal length','sepal width', 'petal length',
       'petal width']

In [39]:
iris

     sepal length  sepal width  petal length  petal width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [40]:
iris.columns = iris.columns.str.replace(' ','-')
iris.head(3)

   sepal-length  sepal-width  petal-length  petal-width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2

In [41]:
iris.dtypes

sepal-length    float64
sepal-width     float64
petal-length    float64
petal-width     float64
dtype: object

In [48]:
iris[['sepal-width', 'petal-length']]

     sepal-width  petal-length
0            3.5           1.4
1            3.0           1.4
2            3.2           1.3
3            3.1           1.5
4            3.6           1.4
..           ...           ...
145          3.0           5.2
146          2.5           5.0
147          3.0           5.2
148          3.4           5.4
149          3.0           5.1

[150 rows x 2 columns]

In [49]:
iris[['sepal-width', 'petal-length']] = iris[['sepal-width', 'petal-length']].astype('int')

In [50]:
iris.head(3)

   sepal-length  sepal-width  petal-length  petal-width
0           5.1            3             1          0.2
1           4.9            3             1          0.2
2           4.7            3             1          0.2

# row/column 선택 추가 삭제

In [51]:
from sklearn.datasets import load_iris
import pandas as pd
iris=load_iris()
iris = pd.DataFrame(iris.data, columns=iris.feature_names)
iris[1:4]

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2

In [52]:
iris['sepal length (cm)'].head(4)

0    5.1
1    4.9
2    4.7
3    4.6
Name: sepal length (cm), dtype: float64

In [53]:
iris[['sepal length (cm)','sepal width (cm)']].head(4)

   sepal length (cm)  sepal width (cm)
0                5.1               3.5
1                4.9               3.0
2                4.7               3.2
3                4.6               3.1

In [55]:
iris.iloc[:4]

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2

In [56]:
iris.iloc[:4, 2:3]

   petal length (cm)
0                1.4
1                1.4
2                1.3
3                1.5

In [57]:
iris.loc[:4]

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [59]:
iris.loc[:4, 'sepal length (cm)':'petal width (cm)']

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [63]:
score = pd.DataFrame({"국어":[100,80], '수학':[75,90],'영어':[90,95]}, index=['장화','홍련'])

In [64]:
score

     국어  수학  영어
장화  100  75  90
홍련   80  90  95

In [65]:
score.loc['홍련','영어']=100

In [66]:
score

     국어  수학   영어
장화  100  75   90
홍련   80  90  100

In [67]:
score['국어']= score['국어']-5

In [68]:
score

    국어  수학   영어
장화  95  75   90
홍련  75  90  100

In [69]:
new_stu = pd.DataFrame({"국어":[100,80], '수학':[75,90],'영어':[90,95]}, index=['콩쥐','팥쥐'])

In [70]:
score=score.append(new_stu)
score

     국어  수학   영어
장화   95  75   90
홍련   75  90  100
콩쥐  100  75   90
팥쥐   80  90   95

In [72]:
science = [80,70,90,85]
score['science'] = science
score['학년'] = 1
score

     국어  수학   영어  science  학년
장화   95  75   90       80   1
홍련   75  90  100       70   1
콩쥐  100  75   90       90   1
팥쥐   80  90   95       85   1

In [73]:
score.drop('장화', inplace=True)
score

     국어  수학   영어  science  학년
홍련   75  90  100       70   1
콩쥐  100  75   90       90   1
팥쥐   80  90   95       85   1

In [74]:
score.drop(columns=['science','학년'], inplace=True)
score

     국어  수학   영어
홍련   75  90  100
콩쥐  100  75   90
팥쥐   80  90   95

In [77]:
students = pd.DataFrame({'name':['jang','ghong','kong','pad','hae','dal'], 
                        'korean':[70,85,None,100,None,85 ],
                        'mathe':[65,100,80,95,None,70]})
students[students['name']=='jang']

   name  korean  mathe
0  jang    70.0   65.0

In [78]:
students[(students['korean']>=80) & (students['mathe']>=80)]

    name  korean  mathe
1  ghong    85.0  100.0
3    pad   100.0   95.0

In [80]:
students.loc[6,'name':'mathe']=['byal',50,60]
students.loc[(students['korean']>=80)&(students['mathe']>=70),'pass'] = 'pass'

In [81]:
students

    name  korean  mathe  pass
0   jang    70.0   65.0   NaN
1  ghong    85.0  100.0  pass
2   kong     NaN   80.0   NaN
3    pad   100.0   95.0  pass
4    hae     NaN    NaN   NaN
5    dal    85.0   70.0  pass
6   byal    50.0   60.0   NaN

In [84]:
students.loc[students['pass']!='pass','pass']='fail'

In [91]:
students

    name  korean  mathe  pass
0   jang    70.0   65.0  fail
1  ghong    85.0  100.0  pass
2   kong     NaN   80.0  fail
3    pad   100.0   95.0  pass
4    hae     NaN    NaN  fail
5    dal    85.0   70.0  pass
6   byal    50.0   60.0  fail

In [93]:
import numpy as np
condition = [(students['korean']>=90),
            (students['korean']>=80) & (students['korean']<90),
            (students['korean']>=70) & (students['korean']<80)]

In [95]:
choice = ['A','B','C']
students['score'] = np.select(condition, choice, default='F')
students

    name  korean  mathe  pass score
0   jang    70.0   65.0  fail     C
1  ghong    85.0  100.0  pass     B
2   kong     NaN   80.0  fail     F
3    pad   100.0   95.0  pass     A
4    hae     NaN    NaN  fail     F
5    dal    85.0   70.0  pass     B
6   byal    50.0   60.0  fail     F

In [96]:
students.isna()

    name  korean  mathe   pass  score
0  False   False  False  False  False
1  False   False  False  False  False
2  False    True  False  False  False
3  False   False  False  False  False
4  False    True   True  False  False
5  False   False  False  False  False
6  False   False  False  False  False

In [98]:
students.notna()

   name  korean  mathe  pass  score
0  True    True   True  True   True
1  True    True   True  True   True
2  True   False   True  True   True
3  True    True   True  True   True
4  True   False  False  True   True
5  True    True   True  True   True
6  True    True   True  True   True

In [99]:
students.isna().sum()

name      0
korean    2
mathe     1
pass      0
score     0
dtype: int64

In [100]:
students.isna().sum(1)

0    0
1    0
2    1
3    0
4    2
5    0
6    0
dtype: int64

In [101]:
students

    name  korean  mathe  pass score
0   jang    70.0   65.0  fail     C
1  ghong    85.0  100.0  pass     B
2   kong     NaN   80.0  fail     F
3    pad   100.0   95.0  pass     A
4    hae     NaN    NaN  fail     F
5    dal    85.0   70.0  pass     B
6   byal    50.0   60.0  fail     F

In [102]:
students.dropna()

    name  korean  mathe  pass score
0   jang    70.0   65.0  fail     C
1  ghong    85.0  100.0  pass     B
3    pad   100.0   95.0  pass     A
5    dal    85.0   70.0  pass     B
6   byal    50.0   60.0  fail     F

In [103]:
students.dropna(thresh=4)

    name  korean  mathe  pass score
0   jang    70.0   65.0  fail     C
1  ghong    85.0  100.0  pass     B
2   kong     NaN   80.0  fail     F
3    pad   100.0   95.0  pass     A
5    dal    85.0   70.0  pass     B
6   byal    50.0   60.0  fail     F

In [104]:
health = pd.DataFrame({'year':[2017,2018,2019,2020,2021,2022],
                      'height':[160,162,165,None,None,166],
                      'weight':[53,52,None,50,51,54],
                      'sight':[1.2,None,1.2,1.2,1.1,0.8],
                      'sickday':[None,None,None,2,None,1]})
health

   year  height  weight  sight  sickday
0  2017   160.0    53.0    1.2      NaN
1  2018   162.0    52.0    NaN      NaN
2  2019   165.0     NaN    1.2      NaN
3  2020     NaN    50.0    1.2      2.0
4  2021     NaN    51.0    1.1      NaN
5  2022   166.0    54.0    0.8      1.0

In [105]:
health.fillna(0)

   year  height  weight  sight  sickday
0  2017   160.0    53.0    1.2      0.0
1  2018   162.0    52.0    0.0      0.0
2  2019   165.0     0.0    1.2      0.0
3  2020     0.0    50.0    1.2      2.0
4  2021     0.0    51.0    1.1      0.0
5  2022   166.0    54.0    0.8      1.0

In [106]:
health.fillna(health.mean())

   year  height  weight  sight  sickday
0  2017  160.00    53.0    1.2      1.5
1  2018  162.00    52.0    1.1      1.5
2  2019  165.00    52.0    1.2      1.5
3  2020  163.25    50.0    1.2      2.0
4  2021  163.25    51.0    1.1      1.5
5  2022  166.00    54.0    0.8      1.0

In [107]:
health.fillna(health.median())

   year  height  weight  sight  sickday
0  2017   160.0    53.0    1.2      1.5
1  2018   162.0    52.0    1.2      1.5
2  2019   165.0    52.0    1.2      1.5
3  2020   163.5    50.0    1.2      2.0
4  2021   163.5    51.0    1.1      1.5
5  2022   166.0    54.0    0.8      1.0

In [109]:
health.isna().sum()

year       0
height     2
weight     1
sight      1
sickday    4
dtype: int64

In [110]:
health.isna().sum(1)

0    1
1    2
2    2
3    1
4    2
5    0
dtype: int64

In [112]:
health['sickday']=health['sickday'].fillna(0)
health['weight']=health['weight'].fillna(health['weight'].mean())

In [114]:
health.fillna(method='pad',inplace=True) # 결측값 나오기 바로 전 값으로 대체

In [115]:
health

   year  height  weight  sight  sickday
0  2017   160.0    53.0    1.2      0.0
1  2018   162.0    52.0    1.2      0.0
2  2019   165.0    52.0    1.2      0.0
3  2020   165.0    50.0    1.2      2.0
4  2021   165.0    51.0    1.1      0.0
5  2022   166.0    54.0    0.8      1.0

In [117]:
health['height'].drop_duplicates()

0    160.0
1    162.0
2    165.0
5    166.0
Name: height, dtype: float64

In [118]:
set(health['height'])

{160.0, 162.0, 165.0, 166.0}

In [119]:
health[['sight','sickday']]

   sight  sickday
0    1.2      0.0
1    1.2      0.0
2    1.2      0.0
3    1.2      2.0
4    1.1      0.0
5    0.8      1.0

In [120]:
health[['sight','sickday']].drop_duplicates()

   sight  sickday
0    1.2      0.0
3    1.2      2.0
4    1.1      0.0
5    0.8      1.0

# 데이터 정렬

In [121]:
import pandas as pd
from sklearn.datasets import load_iris
iris=load_iris()

In [124]:
iris =  pd.DataFrame(iris.data, columns=iris.feature_names)

In [125]:
iris

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [126]:
#index로 정렬
iris.sort_index(ascending=False, inplace=True)
iris.head()

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
149                5.9               3.0                5.1               1.8
148                6.2               3.4                5.4               2.3
147                6.5               3.0                5.2               2.0
146                6.3               2.5                5.0               1.9
145                6.7               3.0                5.2               2.3

In [127]:
#컬럼명 정렬
iris.sort_index(axis=1, ascending=True, inplace=True)
iris.head()

     petal length (cm)  petal width (cm)  sepal length (cm)  sepal width (cm)
149                5.1               1.8                5.9               3.0
148                5.4               2.3                6.2               3.4
147                5.2               2.0                6.5               3.0
146                5.0               1.9                6.3               2.5
145                5.2               2.3                6.7               3.0

In [129]:
iris.sort_values('petal length (cm)',ascending=True, inplace=True)
iris.head(10)

    petal length (cm)  petal width (cm)  sepal length (cm)  sepal width (cm)
22                1.0               0.2                4.6               3.6
13                1.1               0.1                4.3               3.0
14                1.2               0.2                5.8               4.0
35                1.2               0.2                5.0               3.2
41                1.3               0.3                4.5               2.3
2                 1.3               0.2                4.7               3.2
38                1.3               0.2                4.4               3.0
42                1.3               0.2                4.4               3.2
36                1.3               0.2                5.5               3.5
16                1.3               0.4                5.4               3.9

In [130]:
HR1=pd.DataFrame({'name':['jang','hong'],
                 'department':['sales','account'],
                 'position':['manager','assistant']})
HR2=pd.DataFrame({'name':['kong','pad'],
                 'department':['sales','hp'],
                 'position':['assistane','manager']})
pd.concat([HR1,HR2],axis=0)

   name department   position
0  jang      sales    manager
1  hong    account  assistant
0  kong      sales  assistane
1   pad         hp    manager

In [131]:
pd.concat([HR1,HR2],axis=0, ignore_index=True)

   name department   position
0  jang      sales    manager
1  hong    account  assistant
2  kong      sales  assistane
3   pad         hp    manager

In [132]:
HR3=pd.DataFrame({'name':['kong','pad'],
                 'department':['sales','hp'],
                 'salary':[3500,2800]})
pd.concat([HR1, HR3],axis=0,ignore_index=True)

   name department   position  salary
0  jang      sales    manager     NaN
1  hong    account  assistant     NaN
2  kong      sales        NaN  3500.0
3   pad         hp        NaN  2800.0

In [134]:
HR4=pd.Series({1:2500},name='salary')
pd.concat([HR1,HR4],axis=1)

   name department   position  salary
0  jang      sales    manager     NaN
1  hong    account  assistant  2500.0

# join merge

In [135]:
product = pd.DataFrame({'code':['G1','G2','G3','G4'],
                       'name':['milk','potato','bread','chicken']})
sales = pd.DataFrame({'number':[1001,1002,1002,1003,1004],
                      'code':['G4','G3','G1','G3','G5'],
                       'count':[1,4,2,2,3]})

In [136]:
product

  code     name
0   G1     milk
1   G2   potato
2   G3    bread
3   G4  chicken

In [137]:
sales

   number code  count
0    1001   G4      1
1    1002   G3      4
2    1002   G1      2
3    1003   G3      2
4    1004   G5      3

In [138]:
sales.merge(product,on='code',how='inner')

   number code  count     name
0    1001   G4      1  chicken
1    1002   G3      4    bread
2    1003   G3      2    bread
3    1002   G1      2     milk

In [139]:
sales.merge(product,on='code',how='outer')

   number code  count     name
0  1001.0   G4    1.0  chicken
1  1002.0   G3    4.0    bread
2  1003.0   G3    2.0    bread
3  1002.0   G1    2.0     milk
4  1004.0   G5    3.0      NaN
5     NaN   G2    NaN   potato

In [142]:
sales.merge(product,on='code',how='outer',sort=True)

   number code  count     name
0  1002.0   G1    2.0     milk
1     NaN   G2    NaN   potato
2  1002.0   G3    4.0    bread
3  1003.0   G3    2.0    bread
4  1001.0   G4    1.0  chicken
5  1004.0   G5    3.0      NaN

In [140]:
product.merge(sales,on='code',how='inner')

  code     name  number  count
0   G1     milk    1002      2
1   G3    bread    1002      4
2   G3    bread    1003      2
3   G4  chicken    1001      1

In [141]:
product.merge(sales,on='code',how='outer')

  code     name  number  count
0   G1     milk  1002.0    2.0
1   G2   potato     NaN    NaN
2   G3    bread  1002.0    4.0
3   G3    bread  1003.0    2.0
4   G4  chicken  1001.0    1.0
5   G5      NaN  1004.0    3.0

In [143]:
sales.merge(product, left_on='code',right_on='code',how='left')

   number code  count     name
0    1001   G4      1  chicken
1    1002   G3      4    bread
2    1002   G1      2     milk
3    1003   G3      2    bread
4    1004   G5      3      NaN

In [144]:
sales.merge(product,on='code',how='inner')

   number code  count     name
0    1001   G4      1  chicken
1    1002   G3      4    bread
2    1003   G3      2    bread
3    1002   G1      2     milk

In [145]:
sales

   number code  count
0    1001   G4      1
1    1002   G3      4
2    1002   G1      2
3    1003   G3      2
4    1004   G5      3

In [148]:
from sklearn.datasets import load_iris
IRIS = load_iris()
iris = pd.DataFrame(IRIS.data, columns=IRIS.feature_names)
iris

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [150]:
IRIS.target

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

In [149]:
iris['class']=IRIS.target
iris['class']=iris['class'].map({0:'setosa',1:'versicolor',2:'virginica'})
iris.groupby(by='class').mean()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
class,,,,
setosa,5.006,3.428,1.462,0.246
versicolor,5.936,2.770,4.260,1.326
virginica,6.588,2.974,5.552,2.026

In [151]:
pd.Series(iris['class']).value_counts()

versicolor    50
virginica     50
setosa        50
Name: class, dtype: int64

In [152]:
iris['petal width level']=pd.qcut(iris['petal width (cm)'],q=3, labels=['short','middle','long'])
iris

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),class,petal width level
0,5.1,3.5,1.4,0.2,setosa,short
1,4.9,3.0,1.4,0.2,setosa,short
2,4.7,3.2,1.3,0.2,setosa,short
3,4.6,3.1,1.5,0.2,setosa,short
4,5.0,3.6,1.4,0.2,setosa,short
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,long
146,6.3,2.5,5.0,1.9,virginica,long
147,6.5,3.0,5.2,2.0,virginica,long
148,6.2,3.4,5.4,2.3,virginica,long
149,5.9,3.0,5.1,1.8,virginica,long

In [153]:

pd.Series(iris['petal width level']).value_counts().to_frame()

        petal width level
middle                 52
short                  50
long                   48

In [154]:
pd.crosstab(iris['petal width level'],iris['class'])

class              setosa  versicolor  virginica
petal width level
short                  50           0          0
middle                  0          48          4
long                    0           2         46

# 재구조화

In [156]:
score = pd.DataFrame({'grade':[1,1,1,1,2,2],
                     'class':['A','A','B','B','C','C'],
                     'sex':['female','male','female','male','female','male'],
                     'score':[76,88,85,72,68,70]})
score

   grade class     sex  score
0      1     A  female     76
1      1     A    male     88
2      1     B  female     85
3      1     B    male     72
4      2     C  female     68
5      2     C    male     70

In [157]:
score_pivot = score.pivot_table(index=['grade','class'],
                               columns='sex',values='score')
score_pivot

sex          female  male
grade class
1     A          76    88
      B          85    72
2     C          68    70

In [159]:
score_pivot.reset_index().melt(id_vars=['grade','class'],var_name='sex',value_name='score')

   grade class     sex  score
0      1     A  female     76
1      1     B  female     85
2      2     C  female     68
3      1     A    male     88
4      1     B    male     72
5      2     C    male     70

# apply

In [161]:
import numpy as np
score_pivot.apply(np.sqrt, axis=0)

sex            female      male
grade class
1     A      8.717798  9.380832
      B      9.219544  8.485281
2     C      8.246211  8.366600

In [163]:
def plus_five(val):
    return val+5
score_pivot.apply(plus_five)

sex          female  male
grade class
1     A          81    93
      B          90    77
2     C          73    75

In [167]:
import math
def class_avg(df):
    return math.ceil((df['male']+df['female'])/2)
score_pivot.apply(class_avg, axis=1)

grade  class
1      A        82
       B        79
2      C        69
dtype: int64

# map

In [168]:
score_pivot['male'].map(lambda x:x+5)

grade  class
1      A        93
       B        77
2      C        75
Name: male, dtype: int64

In [171]:
landmark = pd.DataFrame({'name':['kang','ho','chum'],
                        'location':['seoul si','pohang si','kyungju si']})
landmark['location'].str[3:6]

0    ul
1    ang
2    ngj
Name: location, dtype: object

In [173]:
landmark['location'].str.split(' ',expand=True)

         0   1
0    seoul  si
1   pohang  si
2  kyungju  si

In [175]:
landmark['loc_1'] = landmark['location'].str.split(' ').str[0]

In [177]:
landmark

   name    location    loc_1
0  kang    seoul si    seoul
1    ho   pohang si   pohang
2  chum  kyungju si  kyungju

In [179]:
landmark['location'].str.startswith('seoul')

0     True
1    False
2    False
Name: location, dtype: bool

In [180]:
landmark['location'].str.endswith('si')

0    True
1    True
2    True
Name: location, dtype: bool

In [181]:
landmark['location'].str.contains('i')

0    True
1    True
2    True
Name: location, dtype: bool

# 날짜

In [182]:
from datetime import datetime
datetime.today()

datetime.datetime(2022, 6, 20, 21, 59, 17, 9164)

In [185]:
datetime.today().year

2022

In [186]:
datetime.today().day

20

In [189]:
datetime.strptime('2022-01-01 00:00:00','%Y-%m-%d %H:%M:%S')

datetime.datetime(2022, 1, 1, 0, 0)

In [191]:
time = datetime.today()
time

datetime.datetime(2022, 6, 20, 22, 2, 11, 144994)

In [193]:
time.strftime('%Y-%m-%d %H:%M:%S')

'2022-06-20 22:02:11'

In [194]:
from datetime import timedelta
time = datetime.today()
time + timedelta(days=100)

datetime.datetime(2022, 9, 28, 22, 3, 30, 861351)

In [195]:
time - timedelta(minutes=100)

datetime.datetime(2022, 6, 20, 20, 23, 30, 861351)

In [196]:
time + timedelta(minutes=100)

datetime.datetime(2022, 6, 20, 23, 43, 30, 861351)